/* Напишите программу для моделирования увеличения суммы вклада в банке, который удваивается каждый месяц.
Пользователь должен ввести первоначальную сумму вклада и количество месяцев.
Программа должна выводить данные о вкладе за каждый месяц.

Sample Input 1:
1000
5
Sample Output 1:

Месяц 1: 1000
Месяц 2: 2000
Месяц 3: 4000
Месяц 4: 8000
Месяц 5: 16000
 */
/*
let summa = Number(prompt("Введите сумму вклада:"));
let months = Number(prompt("Введите количесвто месяцев:"));
*/



let summa = 1000;
const months = 5;
for (let i = 1; i <= months; i++) {
    console.log("Месяц " + i + ": " + summa);
    summa *= 2;
}
