/*
Напишите программу, которая будет определять, давать ли скидку покупателю
в зависимости от его общей суммы покупок, которую он вводит самостоятельно.
Если сумма больше или равна 1000, выведите стоимость со скидкой 10%
и сообщение "Спасибо за покупку" на новой строке.
Если сумма меньше 1000, программа выводит только сообщение "Спасибо за покупку".

Sample Input 1:
1000
Sample Output 1:
900
Спасибо за покупку

Sample Input 2:
990
Sample Output 2:
Спасибо за покупку
 */


//let userInput = Number(prompt());
let userInput = 11000;
if (userInput>=1000){
    let newPrice = userInput*0.9;
    console.log(newPrice);

    console.log("Спасибо за покупку");
}
else {
    console.log("Спасибо за покупку");
}
