/*
Напишите программу, которая проверяет,
является ли введенное пользователем число четным и положительным одновременно.
Если введенное число больше нуля и оно четное,
то выводится сообщение "Четное и положительное".
Если одно из условий не выполняется, ничего не выводится.

Sample Input 1:
2
Sample Output 1:
Четное и положительное

Sample Input 2:
-9
Sample Output 2:
 */

//let num = Number(prompt());
let num = 8;
let res = num%2;
if (num>0 && res ===0){
    console.log("Четное и положительное");
}



