/*
Создайте программу для оценки достижения пользователем цели.
Пользователь вводит два числа: сначала количество выполненных задач,
а затем количество поставленных изначально задач.
Используя тернарный оператор, определите, достиг ли пользователь своей цели, и выведите соответствующее сообщение.

Если количество выполненных задач больше или равно количеству поставленных изначально задач, выводится "Цель достигнута".
В противном случае, выводится "Цель не достигнута".

Sample Input 1:
2
108

Sample Output 1:
Цель не достигнута

 */


let done = 5;
let tasks = 8;

//let done = Number(prompt("Введите количество выполненных задач:"));
//let tasks = Number(prompt("Введите количество поставленных задач:"));
let success =
    done >= tasks
        ? "Цель достигнута"
        : "Цель не достигнута";

console.log(success);





