/*
Создайте программу для вычисления стоимости доставки товара в зависимости от его веса.
Запросите у пользователя вес товара. Используя тернарный оператор,
определите стоимость доставки в зависимости от введенного веса:

Если вес товара менее или равен 5 кг, стоимость - 200 рублей.
Если вес товара больше 5 кг, стоимость - 350 рублей.

Sample Input 1:
4

Sample Output 1:
Стоимость доставки: 200 рублей
 */





//let weight = Number(prompt("Введите вес товара:"));
let weight = 25;

let delivery =
    weight >0 && weight <=5
        ? "Стоимость доставки: 200 рублей"
        : weight >5 && weight <= 10
            ? "Стоимость доставки: 350 рублей"
            : "Стоимость доставки: 500 рублей";

console.log(delivery);


