
/* программа, которая должна принимать от пользователя количество строк Y
и выводить пирамиду из чисел, где каждая строка содержит числа от 1 до текущего номера строки.
 Впишите вместо многоточия правильное условие для вложенного цикла.

Sample Input 1:
 4

Sample Output 1:

1
1 2
1 2 3
1 2 3 4
*/



/* let Y = Number(prompt("Введите целое число:")); */

let Y = 4;

for (let i = 1; i <= Y; i++) {
    let row = "";
    for (let j = 1; j <= i; j++) {
        row += j + " ";
    }
    console.log(row);
}