/*
Напишите программу, которая запрашивает у пользователя его имя и возраст, затем объявляет функцию,
которая принимает имя и возраст как параметры и выводит на экран персонализированное приветствие.
Вызовите функцию.
 */




function greetUser (name, age) {

    // console.log("Привет, name +". Тебе " + age + "лет.");
    console.log(`Привет, ${name}. Тебе ${age} лет.`);

}

/* let userName = prompt();
* let userAge = Number(prompt()); */

let userName = "Маша";
let userAge = 31;
// Вызов функции

greetUser(userName, userAge); // круглые скобки обязательны при вызове


