/*
Напишите программу, которая запрашивает у пользователя
длины трех сторон треугольника и объявляет функцию checkTriangleExistence,
 которая принимает длины сторон в качестве параметров и возвращает сообщение о том,
  существует ли треугольник с такими сторонами или нет.


Чтобы проверить треугольник на существование,
нужно сравнить каждую сторону с суммой двух других.
Если хотя бы в одном случае сторона окажется больше
либо равна сумме двух других, то треугольника
с такими сторонами не существует


 */

function checkTriangleExistence(a, b, c, ) {
if (a>=(b+c)||b>=(a+c)||c>=(a+b)){
    return(console.log("Треугольник не существует"));
    } else {
    return(console.log("Треугольник существует"));
}
}

/*
let A = Number(prompt());
let B = Number(prompt());
let C = Number(prompt());
*/

let A = 4;
let B = 2;
let C = 3;

checkTriangleExistence(A, B, C);


