/*
Пользователь вводит возраст.
Напишите программу, которая проверяет, является ли введенное значение числом
и находится ли оно в диапазоне от 18 до 65 лет включительно.
Если введенное значение не является числом, программа выводит сообщение об ошибке.
Если число не попадает в диапазон выводится "Доступ запрещен",
в иных случаях выводится сообщение "Доступ разрешен".

Sample Input 1:
call me babydoll

Sample Output 1:
Ошибка: Введите ваш возраст

Sample Input 2:
97

Sample Output 2:
Доступ запрещен

Sample Input 3:
18

Sample Output 3:
Доступ разрешен
 */
//const sentence = prompt();
let sentence = "aaa";
if (isNaN(sentence)) {
    console.log("Ошибка: Введите ваш возраст");
} else {
    if (sentence < 18) {
        console.log("Доступ запрещен");
    } else {
        if (sentence <= 65) {
            console.log("Доступ разрешен");
        } else {
            console.log("Доступ запрещен");
        }
    }
}



