/*
Напишите программу, которая будет принимать от пользователя число X и выводить таблицу
умножения каждого числа в диапазоне от 1 до X включительно на числа от 1 до 5.

Sample Input 1:

3

Sample Output 1:

Таблица умножения для числа 1:
1 * 1 = 1
1 * 2 = 2
1 * 3 = 3
1 * 4 = 4
1 * 5 = 5
Таблица умножения для числа 2:
2 * 1 = 2
2 * 2 = 4
2 * 3 = 6
2 * 4 = 8
2 * 5 = 10
Таблица умножения для числа 3:
3 * 1 = 3
3 * 2 = 6
3 * 3 = 9
3 * 4 = 12
3 * 5 = 15
 */

/*let X = Number(prompt("Введите число:"));

 */

let X = 4;

for (let i = 1; i <=X; i++) {
        console.log("Таблица умножения для числа " + i + ":");
        for (let k = 1; k <= 5; k++) {
            console.log(i + " * " + k + " = " + (i * k));
        }
}


