
/*
Создайте объект book с информацией о книге. Попросите пользователя ввести следующие данные о книге:

    Название книги.
    Автор книги.
    Год издания книги.

Затем напишите программу, которая использует этот объект для вывода информации о книге в заявленном формате.

Sample Input 1:

Чапаев и Пустота
Виктор Пелевин
1996

Sample Output 1:

Название книги: Чапаев и Пустота
Автор книги: Виктор Пелевин
Год издания книги: 1996



*/

/*
let title = prompt("Введите название книги: ");
let author = prompt("Введите автора книги:");
let year = prompt("Введите год издания книги: ");

 */

let title = "Чапаев и Пустота";
let author = "Виктор Пелевин";
let year = 1996;

let book = {
    title,
    author,
    year,
};

console.log("Название книги: " + book.title);
console.log("Автор книги: " + book.author);
console.log("Год издания книги: " + book.year);




