/*
Перед вами программа, которая должна
запрашивать у пользователя два целых числа:
начальное и конечное значения диапазона.
Затем программа должна вычислить и вывести сумму всех чисел в указанном диапазоне.
 */
/*
Впишите вместо многоточия верное начало, условие и шаг.

let start = Number(prompt("Введите начальное значение диапазона:"));
let end = Number(prompt("Введите конечное значение диапазона:"));
 */
let start = 3;
let end = 7;
let sum = 0;

for (let i = start; i <= end; i++) {
    sum += i;
}
console.log(sum);