/*


Перед вами массив fruits, в котором перечислены фрукты.
Вам нужно удалить первые два фрукта из массива и добавить на их место "Апельсин" и "Банан"
 с помощью методов массива. Выведите окончательный массив.

let fruits = ["Яблоко", "Груша", "Вишня", "Абрикос"];

Sample Input:


Sample Output:

[ 'Апельсин', 'Банан', 'Вишня', 'Абрикос' ]


 */

let fruits = ["Яблоко", "Груша", "Вишня", "Абрикос"];
const firstFruit = fruits.shift();
const secondFruit = fruits.shift();
fruits.unshift("Апельсин", "Банан");
console.log(fruits);